# InvalidOpenLoopsForFaceSplit Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FaceSplitterFailures..::..InvalidOpenLoopsForFaceSplit Property
BuiltInFailures..::..FaceSplitterFailures Class See Also
---
The open loops used to split the face must lie completely within the face and cannot intersect or overlap any of the face's edges.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InvalidOpenLoopsForFaceSplit { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InvalidOpenLoopsForFaceSplit As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InvalidOpenLoopsForFaceSplit {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FaceSplitterFailures Class
Autodesk.Revit.DB Namespace